nursingengineeringlab/emg_repo_v2/emg_sensor_nrf5_SDK/app/project/ble_peripheral/ble_app_template/main.c
/**
 * @file       main.c
 * @version    1.0.0
 * @date       2022-09-25
 * @author     Abu Bony Amin, Ebenezer Asabre, Akshat Sahay 
 * @brief      EMG Signal Collection and Analysis 
 * @note       None
 * @example    None
 */




/* Includes ----------------------------------------------------------- */
#include <stdint.h>
#include <string.h>
#include <stdarg.h>
#include <stddef.h>
#include <math.h>

// for frequency
#include <stddef.h>
#include <stdint.h>
#include <complex.h>
#include <stdio.h>
#include <stdlib.h>
#include <time.h>



#include "nordic_common.h"
#include "app_error.h"
#include "boards.h"
#include "nrf.h"
#include "ble_hci.h"
#include "ble_advdata.h"
#include "ble_advertising.h"
#include "ble_conn_params.h"
#include "nrf_sdh.h"
#include "nrf_sdh_soc.h"
#include "nrf_sdh_ble.h"
#include "nrf_ble_gatt.h"
#include "nrf_ble_qwr.h"
#include "app_timer.h"
#include "app_util_platform.h"
#include "bsp_btn_ble.h"
#include "nrf_pwr_mgmt.h"
#include "nrf_delay.h"
#include "nrf_drv_gpiote.h"

#include "ble_lbs.h"


#include "sys_bm.h"
#include "ble_bas.h"
#include "ble_dis.h"
#include "ble_acs.h"
#include "ble_mgs.h"
#include "ble_gys.h"
#include "bsp_hw.h"
#include "bsp_imu.h"
#include "bsp_afe.h"
#include "bsp_nand_flash.h"
#include "nrf52832_peripherals.h"
#include "sys_logger_flash.h"
#include "sys_button.h"
#include "damos_ram.h"
#include "uart.h"
#include "bno085.h"
#include "fft.h"

#include "ble_nhrs.h"




#if defined(UART_PRESENT)
#include "nrf_uart.h"
#endif
#if defined(UARTE_PRESENT)
#include "nrf_uarte.h"
#endif


#define ADVERTISING_LED                 BSP_BOARD_LED_0                         /**< Is on when device is advertising. */

/* Private defines ---------------------------------------------------- */
#define APP_BLE_CONN_CFG_TAG            1                                          /**< A tag identifying the SoftDevice BLE configuration. */

#define SENSORS_MEAS_INTERVAL           APP_TIMER_TICKS(2000)                      /**< Sensors measurement interval (ticks). */
#define BATT_LEVEL_MEAS_INTERVAL        APP_TIMER_TICKS(20000)                     /**< Battery level measurement interval (ticks). */

#define DEVICE_NAME                     "imu-lcd"                                  /**< Name of device. Will be included in the advertising data. */

#define MANUFACTURER_NAME               "miBEAT"                                   /**< Manufacturer. Will be passed to Device Information Service. */

#define ACS_SERVICE_UUID_TYPE           BLE_UUID_TYPE_VENDOR_BEGIN                  /**< UUID type for the Nordic UART Service (vendor specific). */

#define APP_BLE_OBSERVER_PRIO           3                                           /**< Application's BLE observer priority. You shouldn't need to modify this value. */

#define APP_ADV_INTERVAL                64                                          /**< The advertising interval (in units of 0.625 ms. This value corresponds to 40 ms). */

#define APP_ADV_DURATION                18000                                       /**< The advertising duration (180 seconds) in units of 10 milliseconds. */

#define MIN_CONN_INTERVAL               MSEC_TO_UNITS(20, UNIT_1_25_MS)             /**< Minimum acceptable connection interval (20 ms), Connection interval uses 1.25 ms units. */
#define MAX_CONN_INTERVAL               MSEC_TO_UNITS(75, UNIT_1_25_MS)             /**< Maximum acceptable connection interval (75 ms), Connection interval uses 1.25 ms units. */
#define SLAVE_LATENCY                   0                                           /**< Slave latency. */
#define CONN_SUP_TIMEOUT                MSEC_TO_UNITS(4000, UNIT_10_MS)             /**< Connection supervisory timeout (4 seconds), Supervision Timeout uses 10 ms units. */
#define FIRST_CONN_PARAMS_UPDATE_DELAY  APP_TIMER_TICKS(5000)                       /**< Time from initiating event (connect or start of notification) to first time sd_ble_gap_conn_param_update is called (5 seconds). */
#define NEXT_CONN_PARAMS_UPDATE_DELAY   APP_TIMER_TICKS(30000)                      /**< Time between each call to sd_ble_gap_conn_param_update after the first call (30 seconds). */
#define MAX_CONN_PARAMS_UPDATE_COUNT    3                                           /**< Number of attempts before giving up the connection parameter negotiation. */

// custom
#define LED_STATE_INTERVAL              APP_TIMER_TICKS(2000)                       /** led interval **/

#define HEART_RATE_MEAS_INTERVAL             APP_TIMER_TICKS(2000)  

#define DEAD_BEEF                       0xDEADBEEF                                  /**< Value used as error code on stack dump, can be used to identify stack location on stack unwind. */
#define DEVICE_ID                       0x55AA

#define SCALE_FACTOR_ACC                1000 
#define SCALE_FACTOR_GYR                10000
#define SCALE_FACTOR_MAG                1000 
#define SCALE_FACTOR_EMG                1000

#define TX_BYTE(x) do {} while (app_uart_put((x)) != NRF_SUCCESS)                   /**< Macro for UART TX. */ 


/* Private defines for time */
#define   EMG_SIGNAL_SIZE     64
#define   MA_FILTER_SIZE      8
#define   ENVELOPE_SIZE       16





/* Private macros ----------------------------------------------------- */                                                            /**< BLE HRNS service instance. */
BLE_ACS_DEF(m_acs);                                                                 /**< BLE ACS service instance. */
BLE_MGS_DEF(m_mgs);                                                                 /**< BLE MGS service instance. */
BLE_GYS_DEF(m_gys);                                                                 /**< BLE GYS service instance. */
BLE_BAS_DEF(m_bas);                                                                 /**< Structure used to identify the battery service. */
NRF_BLE_GATT_DEF(m_gatt);                                                           /**< GATT module instance. */
NRF_BLE_QWR_DEF(m_qwr);                                                             /**< Context for the Queued Write module.*/
BLE_ADVERTISING_DEF(m_advertising);                                                 /**< Advertising module instance. */
APP_TIMER_DEF(m_sensors_timer_id);                                                  /**< Sensor measurement timer. */
APP_TIMER_DEF(m_battery_timer_id);                                                  /**< Battery timer. */
APP_TIMER_DEF(m_led_timer_id);                                                      /**< LED timer **/






