nursingengineeringlab/emg_repo_v2/emg_sensor_nrf5_SDK/app/project/ble_peripheral/ble_app_template/main.c
BLE_LBS_DEF(m_lbs);                                                             /**< LED Button Service instance. */
//NRF_BLE_GATT_DEF(m_gatt);                                                       /**< GATT module instance. */
//NRF_BLE_QWR_DEF(m_qwr);                                                         /**< Context for the Queued Write module.*/

//static uint16_t m_conn_handle = BLE_CONN_HANDLE_INVALID;                        /**< Handle of the current connection. */


// custom
BLE_NHRS_DEF(m_nhrs);
APP_TIMER_DEF(m_nhrs_id);

static uint8_t m_adv_handle = BLE_GAP_ADV_SET_HANDLE_NOT_SET;                   /**< Advertising handle used to identify an advertising set. */
static uint8_t m_enc_advdata[BLE_GAP_ADV_SET_DATA_SIZE_MAX];                    /**< Buffer for storing an encoded advertising set. */
static uint8_t m_enc_scan_response_data[BLE_GAP_ADV_SET_DATA_SIZE_MAX];         /**< Buffer for storing an encoded scan data. */

/**@brief Struct that contains pointers to the encoded advertising data. */
static ble_gap_adv_data_t m_adv_data =
{
    .adv_data =
    {
        .p_data = m_enc_advdata,
        .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX
    },
    .scan_rsp_data =
    {
        .p_data = m_enc_scan_response_data,
        .len    = BLE_GAP_ADV_SET_DATA_SIZE_MAX

    }
};




/* Private variables -------------------------------------------------- */
static uint16_t   m_conn_handle          = BLE_CONN_HANDLE_INVALID;                 /**< Handle of the current connection. */
static ble_uuid_t m_adv_uuids[]          =                                          /**< Universally unique service identifier. */
{
  {BLE_UUID_BATTERY_SERVICE,            BLE_UUID_TYPE_BLE},
  {BLE_UUID_DEVICE_INFORMATION_SERVICE, BLE_UUID_TYPE_BLE}
};

uint32_t app_time;                                                                  /**< Elapsed time in the app. */                                                                                                                                           
int16_t emg_value;                                                                  /**< Current raw ECG/EMG sample from AFE. */  
int16_t imu[9];                                                                     /**< IMU data. */
uint8_t imu_size = 0;                                                               /**< Count of valid IMU data. */
uint8_t imu_flags = 0;

// for IMU sensor
uint8_t msec = 0;                                                                 /**< Millisecond counter synchronyzed to AFE interrupts. */

sh2_SensorValue_t sensor_value;

/* Private function prototypes ---------------------------------------- */
static void nrf_qwr_error_handler(uint32_t nrf_error);
static void sleep_mode_enter(void);
static void log_init(void);
static void power_management_init(void);
static void idle_state_handle(void);

static void battery_level_meas_timeout_handler(void * p_context);
static void sensors_meas_timeout_handler(void * p_context);

static void battery_level_update(void);
static void u8p_send(uint8_t field, uint16_t value);
void setReports(void);  


// custom prototypes

//static void application_timers_start(void);




// for ble extra
 static void buttons_init(void);
static void button_event_handler(uint8_t pin_no, uint8_t button_action);
static void ble_stack_init(void);
static void ble_evt_handler(ble_evt_t const * p_ble_evt, void * p_context);
static void advertising_start(void);
static void conn_params_init(void);
static void conn_params_error_handler(uint32_t nrf_error);
static void on_conn_params_evt(ble_conn_params_evt_t * p_evt);
static void services_init(void);
static void led_write_handler(uint16_t conn_handle, ble_lbs_t * p_lbs, uint8_t led_state);
static void advertising_init(void);
static void gatt_init(void);
static void gap_params_init(void);
static void timers_init(void);
static void leds_init(void);






// frequency domain prototypes
float peakfreq(float complex* x, float n, float samplerate);
float median(float complex* x, size_t n, float samplerate);
float mean(float complex* x, size_t n, float samplerate);
float powe(float complex* x, size_t n);
float mag(float complex c);
static int fft_reverse(int b, float complex *buffers[2], size_t N);
static int nop_reverse(int b, float complex *buffers[2], size_t N);
static size_t revbits(size_t v, int J);
static void fft_split(const float complex *x, float complex *X, size_t N, float complex phi);
static void nop_split(const float complex *x, float complex *X, size_t N);
static int ctz(size_t N);

//home/ebenezer/Developer/aquatic-emg-sensor-main_x21ble_now_com_1/

// func prototypes

void ble_update_buffer(void);
void mscl_activator(int16_t imu[9], bool_t * mscl_act);
static void ble_trnsmt(void);


void calc_freq_dom(void);
void calc_time_dom(void);
void mscl_activated(bool_t * mscl_act);
void ble_set_values(void);

void reset_time_dom_features(void);
void reset_freq_dom_features(void);
void emg_mvn_avg(float * emg_value_raw);
void sample_imu(uint8_t * msec);

void show_time_dom(void);
void show_freq_dom(void);

// get LED
#define LED1  17
#define PIN_24  24

/** values for time domain features **/
// parameters for time domain features
float emg_value_raw;
float emg_mav;
float emg_mean_absolute_value;
float emg_integrated;
float emg_ssi;
float emg_variance;
float emg_rms;
int16_t emg_myopulse_percent;
float MA_SUM = 0;

float emg_array_raw[MA_FILTER_SIZE];
uint8_t emg_array_raw_index;
float emg_array_out[EMG_SIGNAL_SIZE];
uint8_t emg_array_out_index;
int16_t emg_envelope[ENVELOPE_SIZE];
uint8_t emg_envelope_index;



// paramters for frequency domain
float complex vector[EMG_SIGNAL_SIZE];
float samplerate = 64;
float meanfreq;
float medianfreq;
float peakfrequ;
float totalpower;
uint8_t emg_array_out_index_init;

// parameters for ble transmit
uint32_t dcd_emg_mav;
uint32_t dcd_emg_integrated;
uint32_t dcd_emg_ssi;
uint32_t dcd_emg_variance;

uint32_t dcd_meanfreq;
uint32_t dcd_emg;
uint32_t dcd_medianfreq;

 FILE *dev_file;
 bool_t mscl_act;



// function to setup on board led
static void led_setup(void){
  bsp_board_init(BSP_INIT_LEDS);
  nrf_gpio_cfg_output(LED1);
  nrf_gpio_cfg_input(PIN_24, NRF_GPIO_PIN_PULLUP);
  nrf_gpio_pin_clear(LED1);
}

