nursingengineeringlab/emg_repo_v2/emg_sensor_nrf5_SDK/app/project/ble_peripheral/ble_app_template/main.c
// function to regulate on board led
static void led_run(void){
   if(!nrf_gpio_pin_read(PIN_24)){
      nrf_delay_ms(100);
      if(!nrf_gpio_pin_read(PIN_24)){
        nrf_gpio_pin_toggle(LED1);
      }
    }
}


// function to print values of imu data
  void imu_show(int16_t * arr){
    //printf("\n");
    while(*arr != '\0'){
      //printf("%d, ", *arr);
      arr++;
    }  
  }

  /**
    * @brief This function will use IMU values to detect muscle activation
    *
  */
    // 1 function to check if muscle is activated
  void muscle_activator_x(int16_t imu[9], bool_t * mscl_act){
    printf("3 called\n");
    int16_t accel_val_x = (imu[0] < 0) ? (imu[0] * -1): imu[0];
    int16_t accel_cal_y = (imu[1] < 0) ? (imu[1] * -1): imu[1];

    int16_t gyr_val_x = (imu[3] < 0) ? (imu[3] * -1): imu[3];
    int16_t gyr_val_y = (imu[4] < 0) ? (imu[4] * -1): imu[4];
    int16_t gyr_val_z = (imu[5] < 0) ? (imu[5] * -1): imu[5];

    int32_t accl_sum = accel_val_x + accel_cal_y;
    int32_t gyro_sum = gyr_val_x + gyr_val_y + gyr_val_z;

    if(accl_sum > 2500 && gyro_sum > 700 ){
      *mscl_act = BS_TRUE;
    } else { *mscl_act = BS_FALSE; }
  }


  // 2 function to check if muscle is activated
  void mscl_activator(int16_t imu[9], bool_t * mscl_act){

    float accel = sqrtf( (imu[0]*imu[0] + imu[1]*imu[1] + imu[2]*imu[2]) / 3.0);

    float gyr = sqrtf( (imu[3]*imu[3] + imu[4]*imu[4] + imu[5]*imu[5]) / 3.0);

    float mag = sqrtf( (imu[6]*imu[6] + imu[7]*imu[7] + imu[8]*imu[8]) / 3.0);

    /*
        printf("\naccel: %.3f\n", accel );
        printf("gyr: %.3f\n", gyr );
        printf("mag: %.3f\n", mag);
    */

    if(gyr > 120){
      *mscl_act = BS_TRUE;

    } else {
      *mscl_act = BS_FALSE;
    }

  }


  // reset time domain features
  void reset_time_dom_features(void){

      /*
        printf("MA_SUM: %f\n", MA_SUM);
        printf("\nemg_integrated: %f", emg_integrated);
        printf("\nemg_ssi: %f", emg_ssi);
        printf("\nemg_variance: %f", emg_variance);
        printf("\nemg_rms: %f", emg_rms);
 
      */
      MA_SUM = 0;
      emg_integrated = 0.0;
      emg_mean_absolute_value = 0.0;
      emg_ssi = 0.0;
      emg_rms = 0.0;
      emg_variance = 0.0;

  }

void reset_freq_dom_features(void){
  meanfreq = 0.0;
  medianfreq = 0.0;
  peakfrequ  = 0.0;
  totalpower = 0.0;

}


static uint8_t hrm_initial_value [32];

// a redundant structure
typedef struct {
  uint8_t ble_vals[32];
}ble_buf_t;

// keep a copy of immediately sent packet
ble_buf_t ble_dbl_buf;



// initial function to transmit ble
static void ble_trnsmt(void){
//static void update_for_main(ble_buf_t*  buff){
  ret_code_t err_code;
  uint8_t data[2];
  uint16_t len = sizeof(data);

   for(uint8_t i = 0; i < 19; i++)
   {
      data[0] = i+1;
      data[1] = hrm_initial_value[i];

      // redundancy in data transmission
      ble_dbl_buf.ble_vals[i] = hrm_initial_value[i];
      err_code = ble_nhrs_send(&m_nhrs, &hrm_initial_value[i], &len);
   }
}


void show_freq_dom(void){
    printf("Mean Frequency: %lf\n", meanfreq);
    printf("Median Frequency: %lf\n", medianfreq);
    printf("Peak Frequency: %lf\n", peakfrequ);	
    printf("Total Power: %lf\n", totalpower);
}

void show_time_dom(void){

}

void calc_time_dom(void){

    // a pointer to emg_array_out buffer
    float * c = emg_array_out;
    while( *c != '\0'){
            emg_integrated += (*c < 0) ? (*c * -1) : *c;
            emg_ssi += *c * *c;
            c++;
    }
    emg_mean_absolute_value = emg_integrated / EMG_SIGNAL_SIZE;
    emg_variance = emg_ssi / (EMG_SIGNAL_SIZE - 1);
    emg_rms = sqrt(emg_ssi / EMG_SIGNAL_SIZE);
}


void calc_freq_dom(void){

    emg_array_out_index_init = emg_array_out_index;
    fft(vector, emg_array_out_index_init);

    //printf("in frequency domain:\n");

    for(size_t x = 0; x < emg_array_out_index_init; x++) {
            //printf("%f%+fi\n", creal(vector[x]), cimag(vector[x]));
    }
    meanfreq = mean(vector, emg_array_out_index_init, samplerate);
    medianfreq = median(vector, emg_array_out_index_init, samplerate);
    peakfrequ = peakfreq(vector, emg_array_out_index_init, samplerate);
    totalpower = powe(vector,emg_array_out_index_init);

    show_freq_dom();
}




void mscl_activated(bool_t * mscl_act){
  if(*mscl_act == BS_TRUE){
      ble_set_values();
      ble_update_buffer();
      ble_trnsmt();
      reset_time_dom_features();
      reset_freq_dom_features();
  }
}


void ble_set_values(void){
    dcd_emg = (uint32_t) emg_value_raw;
    dcd_emg_mav = (uint32_t)emg_mav;
    dcd_emg_integrated = (uint32_t)(emg_integrated / SCALE_FACTOR_EMG);
    dcd_emg_ssi = (uint32_t)(emg_ssi / SCALE_FACTOR_EMG);
    dcd_emg_variance = (uint32_t)(emg_variance / SCALE_FACTOR_EMG);

    dcd_meanfreq = (uint32_t) meanfreq;
    dcd_medianfreq = (uint32_t) medianfreq;
}


void ble_update_buffer(void){

    hrm_initial_value[0] = 11; // value here is never sent

    hrm_initial_value[1] = ((dcd_emg_mav >> 8) & 0xff);
    hrm_initial_value[2] = (dcd_emg_mav & 0xff);

    hrm_initial_value[3] = ((dcd_emg_integrated >> 24) & 0xff);
    hrm_initial_value[4] = ((dcd_emg_integrated >> 16) & 0xff);
    hrm_initial_value[5] = ((dcd_emg_integrated >> 8) & 0xff);
    hrm_initial_value[6] = (dcd_emg_integrated & 0xff);

    hrm_initial_value[7] = ((dcd_emg_ssi >> 24) & 0xff);
    hrm_initial_value[8] = ((dcd_emg_ssi >> 16) & 0xff);
    hrm_initial_value[9] = ((dcd_emg_ssi >> 8) & 0xff);
    hrm_initial_value[10] = (dcd_emg_ssi & 0xff);

    hrm_initial_value[11] = ((dcd_emg_variance >> 16) & 0xff);
    hrm_initial_value[12] = ((dcd_emg_variance >> 8) & 0xff);
    hrm_initial_value[13] = (dcd_emg_variance & 0xff);

    hrm_initial_value[14] = (dcd_meanfreq >> 8) & 0xff;
    hrm_initial_value[15] = (dcd_meanfreq & 0xff);


    hrm_initial_value[16] = (dcd_emg >> 8) & 0xff;
    hrm_initial_value[17] = (dcd_emg & 0xff);

    hrm_initial_value[18] = (dcd_medianfreq >> 8) & 0xff;
    hrm_initial_value[19] = (dcd_medianfreq & 0xff);

