nursingengineeringlab/emg_repo_v2/emg_sensor_nrf5_SDK/app/project/ble_peripheral/ble_app_template/main.c
    hrm_initial_value[20] = 0;

}

void emg_mvn_avg(float * emg_value_raw){

    emg_array_raw[emg_array_raw_index++] = *emg_value_raw;

    if (emg_array_raw_index >= MA_FILTER_SIZE - 1)
            emg_array_raw_index = 0;

    for(uint8_t i=0; i < MA_FILTER_SIZE; i++)
           MA_SUM += emg_array_raw[i];

    // fill buffer with mav
    emg_mav = MA_SUM / MA_FILTER_SIZE;
    emg_array_out[emg_array_out_index] = emg_mav;

    // fill vector for frequency domain
    vector[emg_array_out_index++] = emg_mav;

    // reset MA_SUM after sum of filter size
    MA_SUM = 0.0; 

}


void sample_imu(uint8_t * msec){
        if (*msec % 20 == 0) {
          // check if IMU was reset 
          if (bno085_was_reset()) setReports();

          // get data from IMU
          if (bno085_get_sensor_event(&sensor_value))
          {
            switch (sensor_value.sensorId)
            {
              case SH2_ACCELEROMETER:
                imu[0] = sensor_value.un.accelerometer.x * SCALE_FACTOR_ACC;
                imu[1] = sensor_value.un.accelerometer.y * SCALE_FACTOR_ACC;
                imu[2] = sensor_value.un.accelerometer.z * SCALE_FACTOR_ACC;
                imu_flags |= 0b001;
                break; 
              case SH2_GYROSCOPE_CALIBRATED:
                imu[3] = sensor_value.un.gyroscope.x * SCALE_FACTOR_GYR; 
                imu[4] = sensor_value.un.gyroscope.y * SCALE_FACTOR_GYR; 
                imu[5] = sensor_value.un.gyroscope.z * SCALE_FACTOR_GYR; 
                imu_flags |= 0b010;
                break;
              case SH2_MAGNETIC_FIELD_CALIBRATED:
                imu[6] = sensor_value.un.magneticField.x * SCALE_FACTOR_MAG;
                imu[7] = sensor_value.un.magneticField.y * SCALE_FACTOR_MAG;
                imu[8] = sensor_value.un.magneticField.z * SCALE_FACTOR_MAG;
                imu_flags |= 0b100;
                break; 
              default: break;
            } 
            mscl_activator(imu, &mscl_act);

            //imu_show(imu);

          } // get data from IMU

        } // sample IMU at 50 Hz = 1/20 sps

        // increment ms counter 
        *msec += 1;
      // decrease semaphore 
}


void reset_index(void){
   if (emg_array_out_index >= EMG_SIGNAL_SIZE){
      emg_array_out_index = 0;
   }
}

void signals_to_csv(FILE *dev_file){
  // write raw signals to  file
  fprintf(dev_file, "%d\n", emg_value);
}


/* Function definitions ----------------------------------------------- */

/**
 * @brief Application main function.
 */

int main(void) { 

    ble_buf_t tem_buff;
    int emg_integrated_send = 0;

    // Initialize.
    log_init();
    led_setup();
    //leds_init();
    timers_init();
    buttons_init();
    power_management_init();
    ble_stack_init();
    gap_params_init();
    gatt_init();
    services_init();
    advertising_init();
    conn_params_init();

    // Start execution.
    NRF_LOG_INFO("Blinky example started.");
    printf("Blink Example started\n");
    advertising_start();

    //samplerate = 64;

    led_setup();
    user_uart_init(); 
    power_management_init();

    // bsp_hw_init configures DRDY as an input 
    bsp_hw_init();
    bsp_afe_init();

    // initialize BNO085 over I2C
    bno085_init();

    setReports();

    //dev_file = fopen("/home/ebenezer/Developer/emg2/emg_noise_3_mscl3.csv", "w+");

    // enter MCU superloop
    for (;;) { 

        led_run();

        if (bsp_afe_get_ecg(&emg_value) == BS_OK) {
            emg_value_raw = (float)emg_value;

            // pass raw value to moving average func
            emg_mvn_avg(&emg_value_raw);

            //signals_to_csv(dev_file);

            //start calculations if buffer is filled
            if(emg_array_out_index == EMG_SIGNAL_SIZE){
                calc_time_dom();
                calc_freq_dom();
                mscl_activated(&mscl_act);
            } 

            // reset array out index
            reset_index();
            sample_imu(&msec);
        }

    } // end of main for loop
 } // end of main



/**
 * @brief         Function for sending UART characters
 *
 * @param[in]     field   Field identifier 
 * @param[in]     value   16-bit value for transmission  
 *
 * @attention     None
 *
 * @return        None
 */
void u8p_send(uint8_t field, uint16_t value) {
    //printf("hello\n");
    // break 16-bit value into 6-6-4 groups 
    uint8_t bits[] = {
        (value >> 12) & 0xf,
        (value >> 6) & 0x3f,
        value & 0x3f
    };

    // break field ID into 2-3
    uint8_t fields[] = {
        (field >> 2) & 0x7,
        (field & 0x3) << 4
    };

    // identifier for a byte in the middle of sequence 
    static const uint8_t continue_byte = 0x80;

    static const uint8_t two_prefix = 0xc0;

    // identifier for EMG data header 
    static const uint8_t three_prefix = 0xe0;

    // identifier for other data header 
    static const uint8_t four_prefix = 0xf0;
    
    if (field) {
        // if field != 0, send 4-byte sequence, if not sending EMG
        TX_BYTE(four_prefix | fields[0]);
        TX_BYTE(continue_byte | fields[1] | bits[0]);
        TX_BYTE(continue_byte | bits[1]);
        TX_BYTE(continue_byte | bits[2]);
    } 
    else if ((value & ~0x7f) == 0) {
        // value of EMG is less than 127  
        TX_BYTE(value); 
    }
    else if ((value & ~0x7ff) == 0) {
        // value of EMG is between 128 and 2047 
        TX_BYTE(two_prefix | bits[1]);
        TX_BYTE(continue_byte | bits[2]);
    }
    else {
        // if field == 0, send 3-byte sequence, if sending EMG
        TX_BYTE(three_prefix | bits[0]);
        TX_BYTE(continue_byte | bits[1]);
        TX_BYTE(continue_byte | bits[2]);
    }
}

// Here is where you define the sensor outputs you want to receive
void setReports(void) {
  // NRF_LOG_INFO("Setting desired reports");
  static const sh2_SensorId_t sensors[] = {
    SH2_ACCELEROMETER,
    SH2_GYROSCOPE_CALIBRATED,
    SH2_MAGNETIC_FIELD_CALIBRATED
  };

  for (int i = 0; i < sizeof(sensors) / sizeof(sh2_SensorId_t); i++) {
    sh2_SensorId_t sensor = sensors[i];

    if (!bno085_enable_report(sensor, 5000)) {
      // NRF_LOG_INFO("Could not enable accelerometer");
      u8p_send(30, 0xE000 | sensor); 
    }
  }
}

/**
 * @brief         Function for assert macro callback.
 *
 * @param[in]     line_num     Line number of the failing ASSERT call.
 * @param[in]     p_file_name  File name of the failing ASSERT call.
 *
 * @attention     None
 *
 * @return        None
 */
void assert_nrf_callback(uint16_t line_num, const uint8_t *p_file_name)
{
  app_error_handler(DEAD_BEEF, line_num, p_file_name);
}

/**
 * @brief         Function for handling Queued Write Module errors.
 *
 * @param[in]     nrf_error   Error code containing information about what went wrong.
 *
 * @attention     None
 *
 * @return        None
 */
static void nrf_qwr_error_handler(uint32_t nrf_error)
{
  APP_ERROR_HANDLER(nrf_error);
}

/**
 * @brief         Function for putting the chip into sleep mode.
 *
 * @param[in]     None
 *
 * @attention     None
 *
 * @return        None
 */
static void sleep_mode_enter(void)
{
  uint32_t err_code = bsp_indication_set(BSP_INDICATE_IDLE);
  APP_ERROR_CHECK(err_code);

